{
    "name": "shield guardian",
    "type": "construct",
    "size": "large",
    "alignment": " unaligned",
    "armor_class": 17,
    "hp": 142,
    "speed": [
        30,
        0,
        0,
        0,
        0
    ],
    "attributes": [
        18,
        8,
        18,
        7,
        10,
        3
    ],
    "challenge": "7",
    "traits_and_actions": "Senses\nblindsight 10 ft., darkvision 60 ft., passive Perception 10\nDamage immunities\npoison\nCondition immunities\ncharmed, exhaustion, frightened, paralyzed, poisoned\nLanguages\nunderstands commands given in any language but can’t speak\nBound.\nThe shield guardian is magically bound to an amulet. As long as the guardian and its amulet are on the same plane of existence, the amulet’s wearer can telepathically call the guardian to travel to it, and the guardian knows the distance and direction to the amulet. If the guardian is within 60 feet of the amulet’s wearer, half of any damage the wearer takes (rounded up) is transferred to the guardian. Regeneration. The shield guardian regains 10 hit points at the start of its turn if it has at least 1 hit point.\nSpell Storing.\nA spellcaster who wears the shield guardian’s amulet can cause the guardian to store one spell of 4th level or lower. To do so, the wearer must cast the spell on the guardian. The spell has no effect but is stored within the guardian. When commanded to do so by the wearer or when a situation arises that was predefined by the spellcaster, the guardian casts the stored spell with any parameters set by the original caster, requiring no components. When the spell is cast or a new spell is stored, any previously stored spell is lost.\nActions\nMultiattack.\nThe guardian makes two fist attacks.\nFist.\nMelee weapon attack:\n+7 to hit, reach 5 ft., one target.\nHit:\n11 (2d6 + 4) bludgeoning damage.\nReactions Shield.\nWhen a creature makes an attack against the wearer of the guardian’s amulet, the guardian grants a +2 bonus to the wearer’s AC if the guardian is within 5 feet of the wearer."
}